of90/tutorials/rheoFoam/OtherTests/Channel2D_VE/otherModels/VCM/0/A
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volSymmTensorField;
    object      A;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform (1 0 0 1 0 1);

boundaryField
{
    inlet
    {
	type            fixedValue;
	value           uniform (1 0 0 1 0 1);
    }
   
    walls
    {
	type            zeroGradient;       
    }

    outlet
    {
	type            zeroGradient;        
    }

    frontAndBack
    {
	type            empty;     
    }
}

// ************************************************************************* //
